{"origin_pdf_path": "https://resources.docs.salesforce.com/latest/latest/en-us/sfdc/pdf/integration_patterns_and_practices.pdf", "text_in_pdf": "4  \n\nDevelopment Tools  \n\nPostgreSQL ships with a powerful command-line client, called psql, which many developers use. The psql client can be used in interactive mode and in batch mode to run more complex scripted operations. It tends to be the preferred choice for experienced PostgreSQL DBAs.  \n\npgAdmin File v Objectv Toolsv HelpvBrowserStatistics Dependencies DependentsProperties SQLUntitled sfits/postgres....sfits/p×puDIICG川 1MMM? Q>↓Collationssfits/postgres@local>Domains>FTS Configurations>FTS Dictionaries >Aa FTS Parsers>FTS Templates>Foreign Tablespublic>FunctionscustomerMaterialized Views >{Procedures id bigint >1..3 SequencesTables (5) fname“char\">customerIname \"char\" public>田lsoutput 田orderorderColumns (4)id bigint date date status“char”\"目id目date>Constraints目 status>Indexes目 customer_id>RLS Policies customer_id bigint>血Rulespublic orderline>→Triggers>orderlineid bigint order_id bigint>田users >Trigger FunctionsTypes > Views Subscrintions目item \"char\" 目qty integer\n\npgAdmin’s ERD diagramming Tool  \n\nThe most popular GUI-based development environment for PostgreSQL is pgAdmin. It can be run as a standalone tool, for one developer only, or it can be configured in a server mode, where teams can collaborate on multiple database servers. The pgAdmin environment supports browsing of database objects, configurations, query development, ERD diagramming, and schema diff to identify patches that need to be rolled into production. EDB’s Postgres Enterprise Manager® (PEM) builds on pgAdmin and incorporates its functionality.  \n\nFor developers coming from Oracle, and who want to stay with a familiar tool, Toad Edge is also an option.  \n\nThere are other development tools that support PostgreSQL too, but pgAdmin is favored by the PostgreSQL development community.  \n\nDevelopment best practices and patterns are well-documented in The Art of PostgreSQL book.  \n\n  \n\nDeployment Tools  \n\nIn the deployment space, there are two major deployment types to focus on:  \n\n  \n\nDeployment of the software  \n\nThat is, the PostgreSQL cluster—and any associated tools  \n\n  \n\n●Deployment of database changes For example, changes to a table definition  \n\n5.1 Deployment of the PostgreSQL cluster and associated tools  \n\nIn virtualized environments, that is on Infrastructure as a Service (IaaS) in public clouds or private clouds such as vSphere, Ansible was the most popular choice among respondents in an EDB survey in June 2020 of infrastructure as code.  \n\nEDB Survey June 2020: Most popular deployment tools  \n\nAnsible Galaxy is the preferred place to download roles and plugins, the key building blocks for Ansible playbook  \n\n  \nEDB Survey June 2020: Most popular deployment  tools  \n\nTerraform is a popular choice to create infrastructure as code in public clouds, where it excels in provisioning compute, storage, and networking. Terraform is frequently used in conjunction with Ansible: Terraform to provision the infrastructure and Ansible to deploy and configure the software.  \n\nApplication developer and IT operations  \n\nIf we look at the results from the user personas angle, it is quite evident that many developers are using Ansible. However, for IT operations, Puppet and Chef are the most popular tools.  \n\nIn containerized environments, Kubernetes (K8s) is the clear leader in public cloud and in private cloud orchestrations built on RedHat OpenShift or Suse Rancher.  \n\n  \nEDB Survey June 2020: Who uses which deployment tool  \n\nApplication developer and IT operations  \n\nPostgreSQL is extremely popular in containerized environments. PostgreSQL is the most popular persistent database deployed in Docker containers.  \n\n  \n\nStolon and Patroni are two popular first generation high availability mechanisms used in containerized environments. Stolon and Patroni coexist with Kubernetes, but they are not really cloud native; they are an add-on that makes PostgreSQL® work with Kubernetes.  \n\nMore recently, proper cloud native approaches have emerged that leverage Kubernetes’ built-in capabilities for high availability, failover, and other cluster operations. EDB’s Cloud Native PostgreSQL is a leading example proving that proper leverage of the new Kubernetes capabilities results in simpler and more robust implementations with fewer moving parts.  \n\n5.2 Deployment of database changes  \n\nFlywheel and Liquibase are very popular frameworks for database version control, implementing Martin Fowler’s evolving database model. Many development frameworks, such as Ruby-on-rails, Django, and others, automatically create “migrations” that can be applied to PostgreSQL too.  \n\n  \nMarch 2021 EDB Survey (top 12 identified tools)  \n\nSecurity Integration  \n\nPostgreSQL security should be seen in the context of the data center or cloud. In both cases, the security of the database needs to be part of a Defense in Depth (DiD) concept. For Cloud Native PostgreSQL based on Kubernetes, the 4C model (Cloud, Cluster, Container, Code) model is the emerging best practice. For PostgreSQL deployments in a data center, the best practice for a DiD is discussed in this whitepaper about Security Best Practices for PostgreSQL.  \n\nWithin PostgreSQL, you need to consider Authentication, Authorization, Auditing, and Encryption.  \n\nFor authentication, PostgreSQL can define users and passwords inside the database. In that case, we recommend using SCRAM authentication to protect the passwords and forgo the less secure MD5 method. If you use locally defined users and passwords, we recommend EDB PostgreSQL password profiles, which allow you to define expiration, complexity, and reuse rules.  \n\nLet’s elaborate on the tools that PostgreSQL offers to integrate with existing authentication environments.  \n\n●SSPI – Use this if you are on a Windows system and would like to implement Single Sign-On (SSO) authentication.  \n\n●LDAP – LDAP is useful in situations where you have large numbers of users (###,###+) and need to manage passwords from a central location. This centralization has the advantage of keeping your pg_hba.conf file small and more manageable and gives your users a unified password experience across your infrastructure. LDAP requires solid infrastructure, as you are relying on the service and connectivity to that service to access your database.  \n\nLDAP should only be used if Kerberos –which includes both SSPI and GSSAPI – is out of the question. LDAP is less secure because passwords are forwarded to the LDAP server, which might be set up in an insecure way.  \n\nRADIUS – Radius should not be used because it has weak encryption, using md5 hashing for credentials.  \n\nCert – TLS certificate authentication, –sometimes referred to as SSL, can be used for encryption of the traffic on the wire and for authentication. Certificates are often used in machine-to-machine communication.  \n\nAuthorization is handled inside the PostgreSQL database, using roles (i.e., term regrouping users and groups) and attributes, such as LOGIN, SUPERUSER, and so on, that are used when defining privileges.  \n\nSeparate audit logging is highly valued in environments with elevated compliance requirements, such as financial services. Standard PostgreSQL does not separate the audit log and the system log. EDB’s Postgres Advanced Server provides a separate audit log, with different levels of logging for DDL, DML, or SELECT operations by object type.  \n\nAuthentication, authorization, and auditing best practices for PostgreSQL are extensively discussed in this blog.  \n\nWatch a series of short videos about PostgreSQL security features.\n\nPostgreSQL Leadership Track  \n\nThe Expert’s Guide to Integrating PostgreSQL ?  \n\nAUTHORED BY:  \n\nMarc Linster, Ph.D. Chief Technology Officer, EDB  \n\nVibhor Kumar Vice President, Performance Engineering, EDB  \n\nContents  \n\n1. Introduction 03  \n\n2. Application Integration 04  \n\n3. Data Integration and Migration 05  \n\n4. Development Tools 06  \n\n5. Deployment Tools 07  \n\n5.1 Deployment of the PostgreSQL Cluster and Associated Tools   \n5.2 Deployment of Database Changes  \n\n6. Security Integration 09  \n\n7. High Availability and Disaster Recovery Tools 11  \n\n8. Management Tools for Monitoring, Alerting, and Tuning 12  \n\n9. Infrastructure Integration 14  \n\n10. Conclusion 14  \n\n1 Introduction  \n\nOver the last decade, open source databases have won the hearts and minds of developers and database operators across the globe. When you double-click on the open source trends, you will clearly see that PostgreSQL® has become the database of choice. The reasons are obvious: innovation, reliability, cost, and support of a wide range of platforms.  \n\nThis whitepaper takes a detailed look at the integration of PostgreSQL® with the enterprise tech stack to help accelerate development and the move to production.  \n\nA 2020 survey of EDB’s enterprise customers tells us that they use PostgreSQL for systems of record, for example customer relationship management or ecommerce transactions $\\pmb{\\mathrm{[5z>20]}}$ , systems of analysis, such as data marts or reporting systems (63%), and systems of engagement, such as  websites or IoT applications (17%). It is important to understand how to integrate PostgreSQL with all facets of the enterprise stack.  \n\n54%  \n\n63%  \n\nECOMMERCE TRANSACTIONS  \n\n17% SYSTEMS OF ENGAGEMENT  \n\nREPORTING SYSTEMS  \n\nThe following sections focus on PostgreSQL integration with:  \n\n  \n\nApplications that create and consume data  \n\nSecurity environments for authentication, authorization, auditing, and encryption  \n\nData integration tools to ensure that PostgreSQL does not become a ‘data island  \n\nHigh availability and disaster recovery tools  \n\nDevelopment tools for application developers and database developers  \n\n  \n\nManagement tools for monitoring, alerting, and tuning  \n\nDeployment tools for the software, the schema, and the data  \n\nInfrastructure considerations for CPU, storage, and network integration  \n\n  \n\nApplication Integration  \n\nPostgreSQL provides a C-based API called libpq, which is the recommended way to connect for applications written in C. Java-based applications leverage the PostgreSQL JDBC driver. ODBC and .NET drivers are also available from the PostgreSQL project. EDB provides Oracle-compatible versions of JDBC, ODBC, and .NET drivers, and OCI compatible drivers that make PostgreSQL look like Oracle to the application. These drivers can to be used in conjunction with EDB’s Postgre Advanced Server.  \n\nAn analysis of Stackoverflow’s PostgreSQL-related traffic in 2020 provides information about what programming languages are popular with PostgreSQL developers. Python is by far the most popular tool. Ruby on Rails appears to be declining in popularity with Java holding steady.  \n\nStackoverflow’s PostgreSQL-related traffic in 2020  \n\nProvides information about what programming languages are popular with PostgreSQL developers.  \n\n  \nStackoverflow analysis of development languages mentioned in the PostgreSQL context  \n\nDjango is an extremely popular framework for Python applications that do not rely on the psycopg2 database driver.   \nJava, often used with Hibernate or Spring, is found largely in mature in-house developed applications.  \n\nNode.js, especially React and Vue.js, is increasingly used in microservices type architectures and for web frameworks.  \n\n3  \n\nData Integration and Migration  \n\nSuccessful PostgreSQL® implementations are fully integrated with the enterprise environment and do not create ‘data islands’.  \n\nPostgreSQL has a native capability to integrate with the ecosystem: Foreign Data Wrappers (FDW), which are an implementation of the SQL MED standard. FDWs were first introduced in PostgreSQL 9.1 and are now widely used to integrate with remote PostgreSQL databases, Hadoop, MySQL, Mongo, Oracle, and so on. As opposed to ETL (Extract, Transform, Load) type implementation tools, FDWs do not copy or move the data; they access the data in place and push as many operations as possible to the remote (foreign) data store.  \n\nWell-implemented FDWs support aggregate and join pushdown, as well as column selection. The FDWs for HDFS, MongoDB, and MySQL are very popular and maintained by EDB. This blog has how-to instructions for using FDWs.  \n\nAn increasing number of ETL vendors are adding PostgreSQL as sources and targets to their integration tools. In a 2021 survey of EDB website visitors, the following tools proved to be very popular with PostgreSQL users (in alphabetical order):  \n\n  \n\nMigration from legacy databases, such as Oracle and SQL Server, is supported by enterprise-grade solutions, such as EDB’s Migration Toolkit and EDB Replication Server, and open source tools, for instance, Orafce or OR2PG. Open source tools tend to be limited to migrations of data definitions and common data types. Specialty tools, like EDB’s Migration Portal and EDB Replication Server, provide a more complete set of capabilities, including change data capture for incremental migrations.", "files_in_pdf": [{"path": ".pdf_temp/viewrange_chunk_2_6_10_1761892235/images/upwckh.jpg", "size": 3746}, {"path": ".pdf_temp/viewrange_chunk_2_6_10_1761892235/images/ejr91q.jpg", "size": 5401}, {"path": ".pdf_temp/viewrange_chunk_2_6_10_1761892235/images/hz6m9b.jpg", "size": 61434}, {"path": ".pdf_temp/viewrange_chunk_2_6_10_1761892235/images/v395zd.jpg", "size": 121155}, {"path": ".pdf_temp/viewrange_chunk_2_6_10_1761892235/images/df9m13.jpg", "size": 237303}, {"path": ".pdf_temp/viewrange_chunk_2_6_10_1761892235/images/otesu2.jpg", "size": 51002}, {"path": ".pdf_temp/viewrange_chunk_2_6_10_1761892235/images/httsw5.jpg", "size": 4146}, {"path": ".pdf_temp/viewrange_chunk_2_6_10_1761892235/images/3v10m1.jpg", "size": 48092}, {"path": ".pdf_temp/viewrange_chunk_1_1_5_1761892238/images/5axkz0.jpg", "size": 138322}, {"path": ".pdf_temp/viewrange_chunk_1_1_5_1761892238/images/7y3gv6.jpg", "size": 11548}, {"path": ".pdf_temp/viewrange_chunk_1_1_5_1761892238/images/typd67.jpg", "size": 5478}, {"path": ".pdf_temp/viewrange_chunk_1_1_5_1761892238/images/2sf2y9.jpg", "size": 94221}, {"path": ".pdf_temp/viewrange_chunk_1_1_5_1761892238/images/z05h5r.jpg", "size": 9965}]}